// Задача 15: Напишите программу, которая принимает на вход цифру, 
// обозначающую день недели, и проверяет, является ли этот день выходным.
// 6 -> да
// 7 -> да
// 1 -> нет

int b = 7;
if (b == 5 + 1 || b == 6 + 1) Console.WriteLine("Yes");
else Console.WriteLine("No");